app/Controllers/Empleados.php

SELECT *
FROM `usuarios`
---
    public function new()
    {
        $usuariosModel = new UsuariosModel();
        $data['usuarios'] = $usuariosModel->findAll();

SELECT *
FROM `usuarios`
SELECT *
FROM `empleados`
WHERE `empleados`.`id` = '2'
---
    public function edit($id = null)
    {
        if ($id == null) {
            return redirect()->to('empleados');
        }

        $empleadosModel = new EmpleadosModel();
        $usuariosModel = new UsuariosModel();

        $data['usuarios'] = $usuariosModel->findAll();
        $data['empleado'] = $empleadosModel->find($id);