app/Models/EmpleadosModel.php

SELECT `empleados`.*, `usuarios`.`tipo_usuario` AS `name_usuario`
FROM `empleados`
JOIN `usuarios` ON `empleados`.`id_tipo_usuario` = `usuarios`.`id`
---
    public function empleadosUsuarios(){
       return $this->select('empleados.*, usuarios.tipo_usuario AS name_usuario')
        ->join('usuarios', 'empleados.id_tipo_usuario = usuarios.id')
        ->findAll();